templates/channelStripTemplate/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    frontAndBack
    {
        type            empty;
        nFaces          13200;
        startFace       12896;
    }
    fixedWalls
    {
        type            wall;
        nFaces          398;
        startFace       26096;
    }
    inlet
    {
        type            patch;
        nFaces          30;
        startFace       26494;
    }
    outlet
    {
        type            patch;
        nFaces          60;
        startFace       26524;
    }
)

// ************************************************************************* //
